# Encoder

|   Cобытие   | Название | Категория | Сложность |
| :---------: | :------: | :-------: | :-------: |
| VKACTF Kids 2023 |  Encoder |  Reverse engineering  |  Средняя  |

## Описание

>Автор: b3rcut7
>
>Хмм, помимо зашифрованных сообщений, я заметил в трафике скрипт и какую-то картинку...Жаль данные не сохранились.
>
>Или всё таки нет?

# Решение

Изучаем код и понимаем, что в данной программе происходит изменение последнего пикселя(синий цвет) в r,g,b палитре на определенных позициях **pos**
Исходные данные у нас есть, осталось написать программу которая бы нам вывела эти данные:

```python
from PIL import Image
image_path = "hidden.png" 
img = Image.open(image_path)
pos = [564, 872, 1210, 178, 1170, 128, 26, 424, 10, 468, 766, 712, 870, 1176, 454, 1150, 1078, 400, 1114, 1106, 1206, 1016, 1234, 382, 138, 804, 578, 412, 796, 144, 148, 368, 736, 724]

for i in range(len(pos)):
    x,y = int(pos[i]/2), int(pos[i]/2)
    r,g,b = img.getpixel((x,y))
    print(chr(b),end='')
```

### Флаг

```
vka{E-C0rP_1s_c0rp0r4t1on_0F_3V!L}
```
